In [125]:
import pandas as pd
import datetime
import numpy as np

dataset = pd.read_csv("cali_renaw.csv")

print(dataset.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 67584 entries, 0 to 67583
Data columns (total 10 columns):
TIMESTAMP        67584 non-null object
BIOGAS           67584 non-null float64
BIOMASS          67584 non-null float64
GEOTHERMAL       67584 non-null float64
Hour             67584 non-null float64
SMALL HYDRO      67584 non-null float64
SOLAR            22680 non-null float64
SOLAR PV         44904 non-null float64
SOLAR THERMAL    44904 non-null float64
WIND TOTAL       67584 non-null float64
dtypes: float64(9), object(1)
memory usage: 5.2+ MB
None

In [126]:
dataset['TIMESTAMP'].head()

0    2011-07-21 00:00:00
1    2011-07-21 01:00:00
2    2011-07-21 02:00:00
3    2011-07-21 03:00:00
4    2011-07-21 04:00:00
Name: TIMESTAMP, dtype: object

In [127]:
dataset['TIMESTAMP'] =  pd.to_datetime(dataset['TIMESTAMP'],
                              format='%Y-%m-%d %H:%M:%S')

In [128]:
dataset['TIMESTAMP'].head()

0   2011-07-21 00:00:00
1   2011-07-21 01:00:00
2   2011-07-21 02:00:00
3   2011-07-21 03:00:00
4   2011-07-21 04:00:00
Name: TIMESTAMP, dtype: datetime64[ns]

In [129]:
dataset.head()

,TIMESTAMP,BIOGAS,BIOMASS,GEOTHERMAL,Hour,SMALL HYDRO,SOLAR,SOLAR PV,SOLAR THERMAL,WIND TOTAL
0,2011-07-21 00:00:00,177.0,372.0,984.0,1.0,516.0,0.0,NaN,NaN,1607.0
1,2011-07-21 01:00:00,176.0,373.0,984.0,2.0,509.0,0.0,NaN,NaN,1619.0
2,2011-07-21 02:00:00,177.0,371.0,985.0,3.0,506.0,0.0,NaN,NaN,1660.0
3,2011-07-21 03:00:00,177.0,374.0,985.0,4.0,504.0,0.0,NaN,NaN,1633.0
4,2011-07-21 04:00:00,177.0,377.0,984.0,5.0,508.0,0.0,NaN,NaN,1520.0

In [130]:
missing_cols = [col for col in dataset.columns if dataset[col].isna().any() == True]
missing_cols

['SOLAR', 'SOLAR PV', 'SOLAR THERMAL']

In [131]:
for i in missing_cols:
    print('The ratio of missing value at col ', i, ' is: ', dataset[i].isna().sum() / dataset.shape[0])

The ratio of missing value at col  SOLAR  is:  0.6644176136363636
The ratio of missing value at col  SOLAR PV  is:  0.33558238636363635
The ratio of missing value at col  SOLAR THERMAL  is:  0.33558238636363635

In [132]:
#Dropping the SOLAR because more than 65 percent of it is NaN

In [133]:
dataset.drop('SOLAR', axis=1, inplace=True)

In [142]:
dataset.head()

,TIMESTAMP,BIOGAS,BIOMASS,GEOTHERMAL,Hour,SMALL HYDRO,SOLAR,SOLAR PV,SOLAR THERMAL,WIND TOTAL
0,2011-07-21 00:00:00,177.0,372.0,984.0,1.0,516.0,0.0,NaN,NaN,1607.0
1,2011-07-21 01:00:00,176.0,373.0,984.0,2.0,509.0,0.0,NaN,NaN,1619.0
2,2011-07-21 02:00:00,177.0,371.0,985.0,3.0,506.0,0.0,NaN,NaN,1660.0
3,2011-07-21 03:00:00,177.0,374.0,985.0,4.0,504.0,0.0,NaN,NaN,1633.0
4,2011-07-21 04:00:00,177.0,377.0,984.0,5.0,508.0,0.0,NaN,NaN,1520.0

In [143]:
from sklearn.impute import SimpleImputer
imp_mean = SimpleImputer(missing_values=np.nan, strategy='mean')

In [144]:
updated_dataset = pd.DataFrame(imp_mean.fit_transform(dataset.iloc[:, 1:]))

In [145]:
updated_dataset.head()

       0      1      2    3      4    5            6           7       8
0  177.0  372.0  984.0  1.0  516.0  0.0  1647.195706  117.254521  1607.0
1  176.0  373.0  984.0  2.0  509.0  0.0  1647.195706  117.254521  1619.0
2  177.0  371.0  985.0  3.0  506.0  0.0  1647.195706  117.254521  1660.0
3  177.0  374.0  985.0  4.0  504.0  0.0  1647.195706  117.254521  1633.0
4  177.0  377.0  984.0  5.0  508.0  0.0  1647.195706  117.254521  1520.0

In [146]:
dataset = pd.read_csv("cali_renaw.csv")

In [147]:
updated_dataset.insert(0, 'TIMESTAMP', dataset['TIMESTAMP'])
updated_dataset

,TIMESTAMP,0,1,2,3,4,5,6,7,8
0,2011-07-21 00:00:00,177.0,372.0,984.0,1.0,516.0,0.0,1647.195706,117.254521,1607.0
1,2011-07-21 01:00:00,176.0,373.0,984.0,2.0,509.0,0.0,1647.195706,117.254521,1619.0
2,2011-07-21 02:00:00,177.0,371.0,985.0,3.0,506.0,0.0,1647.195706,117.254521,1660.0
3,2011-07-21 03:00:00,177.0,374.0,985.0,4.0,504.0,0.0,1647.195706,117.254521,1633.0
4,2011-07-21 04:00:00,177.0,377.0,984.0,5.0,508.0,0.0,1647.195706,117.254521,1520.0

In [148]:
updated_dataset.columns = dataset.columns
updated_dataset.index = dataset.index

In [174]:
updated_dataset = updated_dataset.sort_values(['TIMESTAMP'])

In [171]:
denemed.append(denemed.iloc[:, 1:].sum(axis = 0), ignore_index = True)

,TIMESTAMP,BIOGAS,BIOMASS,GEOTHERMAL,Hour,SMALL HYDRO,SOLAR,SOLAR PV,SOLAR THERMAL,WIND TOTAL
0,2010-04-20 00:00:00,170.0,323.0,1056.0,1.0,250.0,0.0,1647.195706,117.254521,632.0
1,2010-04-20 01:00:00,169.0,318.0,1055.0,2.0,245.0,0.0,1647.195706,117.254521,632.0
2,2010-04-20 02:00:00,168.0,316.0,1058.0,3.0,240.0,0.0,1647.195706,117.254521,677.0
3,NaN,507.0,957.0,3169.0,6.0,735.0,0.0,4941.587119,351.763562,1941.0